## Generadores

In [32]:
def impares():
    i = 1
    lista = [i]
    while(True):  
        yield lista
        i += 2
        lista.append(i)

In [33]:
generador_uno = impares()

In [36]:
print(next(generador_uno))

[1, 3]

In [37]:
def numeros_1(n):
    for i in range(n + 1):
        yield i

In [38]:
def numeros_2(n):
    i = 0
    for j in range(1,n+1):
        i = i + j
    return i

In [39]:
print(sum(numeros_1(1000)))

500500

In [40]:
print(numeros_2(1000))

500500

In [41]:
import time

In [42]:
start_time_1 = time.time()
sum(numeros_1(100000000))
stop_time_1 = time.time()
print(stop_time_1 - start_time_1)

6.752948045730591

In [43]:
start_time_2 = time.time()
numeros_2(100000000)
stop_time_2 = time.time()
print(stop_time_2 - start_time_2)

7.412310838699341

In [44]:
(stop_time_1 - start_time_1) < (stop_time_2 - start_time_2)

True

#### En conclusión los generadores son más eficientes para números grandes

## Clases

In [45]:
class PiezasBateria:
    def __init__(self):
        self.piezas = {
            'Platillos' : [], 
            'Tambores' : [],
            'Microfonos' : [],
            'Baquetas' : [],
            }
        
    def agregar_pieza(self, tipo, parte):
        if tipo == 'Platillo':
            self.piezas['Platillos'].append(parte)
            
        if tipo == 'Tambor':
            self.piezas['Tambores'].append(parte)
            
        if tipo == 'Microfono':
            self.piezas['Microfonos'].append(parte)
            
        if tipo == 'Baquetas':
            self.piezas['Baquetas'].append(parte)
            
        else:
            None
            
        return None
    
    def numero_piezas(self):
        return ( len(self.piezas['Platillos']) 
               + len(self.piezas['Tambores'])
               + len(self.piezas['Microfonos'])
               + len(self.piezas['Baquetas'])
               )

In [46]:
mi_bateria = PiezasBateria()

In [47]:
mi_bateria.agregar_pieza('Platillo', 'Ride')
mi_bateria.agregar_pieza('Platillo', 'Crash')
mi_bateria.agregar_pieza('Platillo', 'Splash')
mi_bateria.agregar_pieza('Platillo', 'China')
mi_bateria.agregar_pieza('Tambor', 'Tom 1')
mi_bateria.agregar_pieza('Tambor', 'Tom 2')
mi_bateria.agregar_pieza('Tambor', 'Tom de Piso')
mi_bateria.agregar_pieza('Tambor', 'Bombo')
mi_bateria.agregar_pieza('Microfono', 'Shure SM57')
mi_bateria.agregar_pieza('Microfono', 'Shure SM58')
mi_bateria.agregar_pieza('Microfono', 'Berhinger C2')
mi_bateria.agregar_pieza('Baquetas', 'ProMark 5B')
mi_bateria.agregar_pieza('Baquetas', 'VicFirth 5B')

In [48]:
mi_bateria.numero_piezas()

13

In [49]:
mi_bateria.piezas

{'Platillos': ['Ride', 'Crash', 'Splash', 'China'],
 'Tambores': ['Tom 1', 'Tom 2', 'Tom de Piso', 'Bombo'],
 'Microfonos': ['Shure SM57', 'Shure SM58', 'Berhinger C2'],
 'Baquetas': ['ProMark 5B', 'VicFirth 5B']}

In [50]:
mi_bateria.piezas['Microfonos']

['Shure SM57', 'Shure SM58', 'Berhinger C2']

## Librerías

### Numpy

In [3]:
import numpy as np

In [4]:
from numpy import pi

In [53]:
print(pi)

3.141592653589793

In [54]:
array_uno = np.array([1, 2, 3])
array_dos = np.array([2, 2, 3])
print(array_uno + array_dos)
print(array_uno * array_dos)
print(array_uno ** array_dos)

[3 4 6]
[2 4 9]
[ 1  4 27]

In [55]:
matriz_uno = np.matrix([
                        [1, 2, 3],
                        [4, 5, 6],
                        [7, 8, 9]
                       ])
print(matriz_uno)

[[1 2 3]
 [4 5 6]
 [7 8 9]]

In [56]:
print(matriz_uno.transpose())

[[1 4 7]
 [2 5 8]
 [3 6 9]]

In [57]:
print(matriz_uno.diagonal())

[[1 5 9]]

In [58]:
print(matriz_uno.reshape([9,1]))

[[1]
 [2]
 [3]
 [4]
 [5]
 [6]
 [7]
 [8]
 [9]]

In [59]:
print( np.linalg.inv(matriz_uno) )

[[ 3.15251974e+15 -6.30503948e+15  3.15251974e+15]
 [-6.30503948e+15  1.26100790e+16 -6.30503948e+15]
 [ 3.15251974e+15 -6.30503948e+15  3.15251974e+15]]

In [60]:
matriz_diagonal = np.matrix([
                             [5, 0, 0],
                             [0, 10, 0],
                             [0, 0, 15]  
                             ])
print(matriz_diagonal)

[[ 5  0  0]
 [ 0 10  0]
 [ 0  0 15]]

In [61]:
print(np.linalg.inv(matriz_diagonal))

[[0.2        0.         0.        ]
 [0.         0.1        0.        ]
 [0.         0.         0.06666667]]

### Pandas

In [18]:
import pandas as pd

In [19]:
bateria_df = pd.DataFrame(
    {
        'Platillos': ['Ride', 'Crash', 'Splash', 'China'],
        'Tambores': ['Tom 1', 'Tom 2', 'Tom de Piso', 'Bombo'],
        'Microfonos': ['Shure SM57', 'Shure SM58', 'Berhinger C2', 'Berhinger C2'],
        'Baquetas': ['ProMark 5B', 'VicFirth 5B', 'ProMark 5A', 'VicFirth 5A']
    },
    index = ['Compra 1', 'Compra 2', 'Compra 3', 'Compra 4']
)

In [20]:
bateria_df

         Platillos     Tambores    Microfonos     Baquetas
Compra 1      Ride        Tom 1    Shure SM57   ProMark 5B
Compra 2     Crash        Tom 2    Shure SM58  VicFirth 5B
Compra 3    Splash  Tom de Piso  Berhinger C2   ProMark 5A
Compra 4     China        Bombo  Berhinger C2  VicFirth 5A

In [21]:
bateria_df[['Platillos', 'Baquetas']]

         Platillos     Baquetas
Compra 1      Ride   ProMark 5B
Compra 2     Crash  VicFirth 5B
Compra 3    Splash   ProMark 5A
Compra 4     China  VicFirth 5A

In [22]:
bateria_df.loc[['Compra 1', 'Compra 2']]

         Platillos Tambores  Microfonos     Baquetas
Compra 1      Ride    Tom 1  Shure SM57   ProMark 5B
Compra 2     Crash    Tom 2  Shure SM58  VicFirth 5B

In [23]:
bateria_df.loc[['Compra 1', 'Compra 2'], ['Platillos', 'Baquetas']]

         Platillos     Baquetas
Compra 1      Ride   ProMark 5B
Compra 2     Crash  VicFirth 5B

In [24]:
bateria_df.iloc[ [0, 2], [0, 2] ]

         Platillos    Microfonos
Compra 1      Ride    Shure SM57
Compra 3    Splash  Berhinger C2

In [25]:
cerveza = pd.read_table('recipe_data.csv',
                       sep = ',',
                       header = 0,
                       decimal = '.',
                       encoding = "latin1")

In [26]:
cerveza.head(8)

   BeerID                                          Name  StyleID   ABV     IBU
0       1                             Vanilla Cream Ale       45  5.48   17.65
1       2                   Southern Tier Pumking clone       85  8.16   60.65
2       3                   Zombie Dust Clone - EXTRACT        7  5.91   59.25
3       4                 Zombie Dust Clone - ALL GRAIN        7  5.80   54.48
4       5               Bakke Brygg Belgisk Blonde 50 l       20  6.48   17.84
5       6                  Sierra Nevada Pale Ale Clone       10  5.58   40.12
6       7      Russian River Pliny the Elder (original)       86  7.09  268.71
7       8  Spotted Clown (New Glarus Spotted Cow clone)       45  5.36   19.97

In [27]:
cerveza.sample(7)

       BeerID                                  Name  StyleID   ABV     IBU
51611   51612                        Mother's Haze.        7  5.51  117.15
28718   28719  SchuBrew IronBrewer Peach/pepper IPA        7  4.81   85.10
23960   23961                       Mosaic Pale Ale       10  5.55   51.54
37772   37773                             Wee Heavy      168  9.20   34.61
431       432                      Bombshell Blonde       30  5.03   21.60
31429   31430                 Milk Chocolate Porter      129  5.86   46.39
51498   51499                            Black Hefe        9  5.51   28.23

In [28]:
cervezas_alcoholicas = cerveza[ cerveza['ABV'] > 15 ]

In [29]:
cervezas_alcoholicas.head(5)

     BeerID                                   Name  StyleID    ABV     IBU
256     257                   120 Minute IPA Clone       86  19.85  165.28
281     282         Apple Cyser with Cherries Mead       46  16.38    0.00
498     499  Century  Russian Imperial Stout (new)      132  18.81  160.74
512     513               Jimmie's Graff version 1      121  27.12    2.62
650     651     End of the World DOUBLE BarleyWine        5  18.38  223.79

In [30]:
(cerveza.query('ABV > 15')).head(7)

     BeerID                                   Name  StyleID    ABV     IBU
256     257                   120 Minute IPA Clone       86  19.85  165.28
281     282         Apple Cyser with Cherries Mead       46  16.38    0.00
498     499  Century  Russian Imperial Stout (new)      132  18.81  160.74
512     513               Jimmie's Graff version 1      121  27.12    2.62
650     651     End of the World DOUBLE BarleyWine        5  18.38  223.79
861     862                       Sack Mead Polish      161  18.52    0.00
884     885                Super Strong Barleywine        5  16.17  290.06

In [31]:
cerveza.query(' ABV == 0 and IBU == 0 ')

       BeerID                                 Name  StyleID  ABV  IBU
1248     1249            Reindeer Piss Holiday Ale       85  0.0  0.0
2248     2249          Fergus Redmead's maple mead      161  0.0  0.0
3354     3355                    Hop Rod Rye clone       15  0.0  0.0
4698     4699                                Berrr      156  0.0  0.0
6218     6219   Unemployment IPA (Stone IPA Clone)        7  0.0  0.0
6659     6660                             FourPure       39  0.0  0.0
6785     6786                 Mark Leyden's Recipe      143  0.0  0.0
7695     7696                Andy Krupp's Recipe 2        7  0.0  0.0
7824     7825               Laura Downing's Recipe      111  0.0  0.0
8185     8186              Davy Pasternak's Recipe      111  0.0  0.0
8307     8308                        Sparkling Ale      111  0.0  0.0
8450     8451            Sergio Bosetti's Recipe 3      111  0.0  0.0
8635     8636           Wheat out on the Boulevard       15  0.0  0.0
8893     8894           Jason Zimmerman's Recipe 3      111  0.0  0.0
8925     8926              Nathan Rushton's Recipe      111  0.0  0.0
9729     9730                Zed  Krundonkulous 90       86  0.0  0.0
10362   10363    Auth Dialog Preview User's Recipe      111  0.0  0.0
11406   11407    Cristian A. Sierra's Recipe Clone      111  0.0  0.0
11839   11840  Auth Dialog Preview User's Recipe 3      111  0.0  0.0
13412   13413       Sean Montgomery's Recipe Clone      111  0.0  0.0
14264   14265            Rangsy Sanouvong's Recipe      111  0.0  0.0
15344   15345                       Awesome Recipe      111  0.0  0.0
26759   26760                   Strawberry mustard        9  0.0  0.0
43220   43221                              PH Test        9  0.0  0.0
70565   70566                          JUNK RECIPE        9  0.0  0.0

In [32]:
cerveza.query(' StyleID in [1, 6, 12, 67, 32] ')

       BeerID                           Name  StyleID   ABV    IBU
45         46    Caribou Slobber (All Grain)        6  5.57  35.32
67         68             Oatmeal Cookie Ale        6  5.53   0.00
83         84       Chocolate Imperial Stout       12  9.16  33.18
118       119                   Blonde Stout       67  7.86  54.32
143       144  Bakke Brygg JuleAle 2016 20 l        6  6.54  42.06
...       ...                            ...      ...   ...    ...
73815   73816                  07B - Altbier        1  5.21  33.94
73818   73819                         Porter       12  5.90  43.70
73821   73822                     Brownberry        6  5.67  30.89
73826   73827                Mateveva elja       12  5.94  37.66
73851   73852                   Blonde Stout       67  7.24  52.94

[3082 rows x 5 columns]

In [33]:
cerveza.query(' StyleID in [1, 6, 12, 67, 32] ').shape

(3082, 5)

In [109]:
cerveza.sort_values(['StyleID'], ascending = True).head(7)

       BeerID                         Name  StyleID   ABV    IBU
56882   56883                   Alt Beer 2        1  5.06  34.32
62434   62435              Helcar Pale Alt        1  5.29  37.25
38696   38697                Vitor Altbier        1  4.32  35.16
38728   38729      Son of an ALTered Beast        1  4.47  40.15
8111     8112               Something Dark        1  5.64  28.27
30599   30600     20170223altbier?????????        1  4.57  27.03
12352   12353  Sleigh'r Clone (double alt)        1  7.26  66.04

In [35]:
A = pd.DataFrame(
    {
        'C1': ['A', 'D', 'C', 'B'], 
        'C2': [12, 11, 4, 6]
    }
)

B = pd.DataFrame(
    {'C1': ['B', 'D'], 
     'C2': [13, 20], 'C3': [1, 2]
    }
)

In [36]:
A

  C1  C2
0  A  12
1  D  11
2  C   4
3  B   6

In [37]:
B

  C1  C2  C3
0  B  13   1
1  D  20   2

In [38]:
pd.concat([A,B])

  C1  C2   C3
0  A  12  NaN
1  D  11  NaN
2  C   4  NaN
3  B   6  NaN
0  B  13  1.0
1  D  20  2.0

In [39]:
pd.concat([B,A])

  C1  C2   C3
0  B  13  1.0
1  D  20  2.0
0  A  12  NaN
1  D  11  NaN
2  C   4  NaN
3  B   6  NaN

In [40]:
B.append(A)

  C1  C2   C3
0  B  13  1.0
1  D  20  2.0
0  A  12  NaN
1  D  11  NaN
2  C   4  NaN
3  B   6  NaN

In [41]:
A.append(B)

  C1  C2   C3
0  A  12  NaN
1  D  11  NaN
2  C   4  NaN
3  B   6  NaN
0  B  13  1.0
1  D  20  2.0

In [42]:
pd.concat([A, B], axis = 1)

  C1  C2   C1    C2   C3
0  A  12    B  13.0  1.0
1  D  11    D  20.0  2.0
2  C   4  NaN   NaN  NaN
3  B   6  NaN   NaN  NaN

In [43]:
A.merge(B, how = 'inner', left_on = ['C1'], right_on = ['C1'])

  C1  C2_x  C2_y  C3
0  D    11    20   2
1  B     6    13   1

In [44]:
A.merge(B, how = 'left', left_on = ['C1'], right_on = ['C1'])

  C1  C2_x  C2_y   C3
0  A    12   NaN  NaN
1  D    11  20.0  2.0
2  C     4   NaN  NaN
3  B     6  13.0  1.0

In [82]:
estilos = pd.read_table(
    'style_data.csv',
    sep = ',',
    header = 0,
    decimal = '.',
    encoding = "latin1"
)

In [83]:
estilos.head(7)

                    Style  StyleID
0                 Altbier        1
1  Alternative Grain Beer        2
2  Alternative Sugar Beer        3
3      American Amber Ale        4
4     American Barleywine        5
5      American Brown Ale        6
6            American IPA        7

In [84]:
pegue = cerveza.merge( estilos, how = 'left', left_on = ['StyleID'], right_on = ['StyleID'] )

In [85]:
pegue.head()

,BeerID,Name,StyleID,ABV,IBU,Style
0,1,Vanilla Cream Ale,45,5.48,17.65,Cream Ale
1,2,Southern Tier Pumking clone,85,8.16,60.65,Holiday/Winter Special Spiced Beer
2,3,Zombie Dust Clone - EXTRACT,7,5.91,59.25,American IPA
3,4,Zombie Dust Clone - ALL GRAIN,7,5.80,54.48,American IPA
4,5,Bakke Brygg Belgisk Blonde 50 l,20,6.48,17.84,Belgian Blond Ale

In [86]:
cervezas_saison = pegue.query('Style == "Saison"')

In [87]:
cervezas_saison.head()

    BeerID                                  Name  StyleID   ABV    IBU   Style
16      17                          Tank 7 Clone      134  7.63  44.94  Saison
22      23                  Brooklyn Sorachi Ace      134  9.10   0.00  Saison
66      67         Siddhartha of Suburbia Saison      134  7.66  31.43  Saison
95      96               Jumpin' Jalapeño Saison      134  5.73  26.51  Saison
97      98  Belgian Saison - Farmhouse Style Ale      134  5.43  16.73  Saison

In [117]:
cerveza.groupby(['StyleID'])['ABV'].mean().reset_index().merge(estilos, how = 'left', left_on = ['StyleID'], right_on = ['StyleID'])

     StyleID        ABV                   Style
0          1   5.104161                 Altbier
1          2   5.419722  Alternative Grain Beer
2          3   7.858571  Alternative Sugar Beer
3          4   5.674657      American Amber Ale
4          5  10.599971     American Barleywine
..       ...        ...                     ...
171      172   9.998780               Wheatwine
172      173   5.960500     Wild Specialty Beer
173      174   6.973161    Winter Seasonal Beer
174      175   5.160784                 Witbier
175      176   8.579701          Wood-Aged Beer

[176 rows x 3 columns]